Revit 2027 API
BuiltInFailures.InfillFailures.MovedInfillToHost Property
 Infilling element was automatically moved to keep it aligned to host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MovedInfillToHost { get; }
Public Shared ReadOnly Property MovedInfillToHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MovedInfillToHost {
	FailureDefinitionId^ get ();
}
static member MovedInfillToHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace